# Створіть дві змінні, is_sunny (чи сонячно) та is_warm (чи тепло), і присвойте їм булеві значення (True або False).
# Перевірте, чи можна йти гуляти (умова: сонячно і тепло). Виведіть результат.
# Перевірте, чи можна вдягнути футболку (умова: сонячно або тепло). Виведіть результат.
from unittest import case

is_sunny = True
is_warm = False
if is_sunny and is_warm:
    print('Можна йти гуляти')
else:
    print('Краще залишитись вдома')

    if is_sunny or is_warm:
        print('Можна одягнути футболку')
    else:
        print('Пошукай в шафі щось інше')

        # Маємо змінні day яка символізує назву дня тижня (наприклад, "Понеділок", "Субота")
        # і за допомогою конструкції match визначає, чи є цей день робочим, вихідним, чи невірною назвою.
        # Визначає тип дня тижня (робочий/вихідний) за його назвою.

match 'Вівторок':
    case 'Понеділок' | 'Вівторок' | 'Середа' | 'Четвер' | "П'ятниця":
        print('Робочий день')
    case 'Субота' | 'Неділя':
        print('Урa, вихідний')
    case _:
        print('Некоректна назва')
